import streamlit as st

def show():
    # Header section
    st.header("ברוכים הבאים לפלטפורמת קורס סימולציה")
    # Introduction section
    st.write("""
    פלטפורמה זו נועדה לסייע לכם ללמוד וליישם מושגי סימולציה באופן אפקטיבי ומעשי.
    השתמשו בסרגל הצד כדי לנווט בין החלקים השונים של הקורס ולגשת למשאבים מגוונים.
    """)
    # Course objectives section
    st.subheader("מטרות הקורס")
    st.write("""
    מטרת הקורס היא להקנות לסטודנטים את הכלים והידע הדרושים לבניית פרויקטי סימולציה בצורה פשוטה ומעשית, תוך שימוש במחשב לדימוי וניתוח תהליכים מהעולם האמיתי.

    הקורס מתמקד בנושאים הבאים:
    - **מידול המערכת**  
    - **יצירת קלט לסימולציה**  
    - **הרצת ניסוי**  
    - **ניתוח פלט ותוצאות**

    הקורס משלב בין תאוריה לפרקטיקה, עם יישום מעשי באמצעות שפת התכנות פייתון.

    בפשטות – הקורס מלמד איך לבנות סימולציה מא' ועד ת'.
    """)

    # Additional resources
    st.subheader("דוגמת הקורס: The Busy Food Truck")
    st.write("""
    אפליקציה זו תאפשר לכם לחקור ולהבין את כל שלבי הסימולציה הנלמדים בהרצאות והתרגולים על ידי יישום של דוגמאת מערכת שירות תוססת ומצליחה!
    בסימולציה זו, תגלו כיצד זרימת לקוחות, ניהול תהליכי הזמנות, הכנת ארוחות ואיסוף משפיעים על הביצועים הכוללים של המערכת.

    #### מטרות הסימולציה:
    - להבין את השפעת הפרמטרים השונים (זמן המתנה, התפלגויות זמן שירות וכו') על חוויית הלקוחות.
    - לחקור תרחישים שונים ולבצע ניתוחי ביצועים.
    - לפתח הבנה מעמיקה של מערכות מורכבות בתנאי אי-וודאות.          
    """)

    # Motivational Quote
    st.subheader("ציטוט היום")
    st.write("""
    "הדרך הטובה ביותר לחזות את העתיד היא לסמלץ אותו." - לא ידוע
    """)

# No need to call show() here, it will be called from main.py